<?php

namespace App\Http\Controllers\Lans;

use Illuminate\Http\Request;

use App\Http\Requests;
use App\Http\Controllers\Controller;

class WorksController extends Controller
{
    public function index(Request $request)
	{

		$line = "<p> Электрошокер – это [оптимальное, незаменимое, эффективное, идеальное, надежное, отличное, практичное, высокоэффективное],  оружие для [самозащиты, самообороны, защиты, обороны, обеспечения безопасности], [поскольку, потому что] оно не требует [специального, особого, специализированного] разрешения. Шокер [позволит, даст возможность, поможет] [защитить, уберечь, обезопасить] вас и ваших [близких, родных] от [недоброжелателей, злоумышленников, хулиганов, преступников, опасных людей, злонамеренных людей, дебоширов] и [бродячих, дворовых, уличных, агрессивных, враждебно настроенных, враждебных, угрожающих,  недружелюбных] [животных, собак, псов].  [Особой, Огромной, Большой, Сильной, Невероятной] популярностью пользуются электрошокеры в городе {город}. [Ухудшение, Обострение, Осложнение] криминогенной [обстановки, ситуации] [ведет, приводит] к [увеличению, росту, возрастанию, повышению, стимуляции, усилению] спроса на средства самообороны. </p> <p> Интернет-магазин ShopShoker.ru предлагает [эффективные, надежные, качественные, мощные, высокоэффективные, современные, действенные, высококачественные, высококлассные, проверенные, первоклассные]  электрошокеры, купить которые можно с доставкой почтой по [всей России, всей стране, РФ, Российской Федерации, всем регионам, всем городам]. Мы предлагаем [удобную, практичную, понятную, доступную] систему оплаты: [пластиковой, кредитной, банковской] картой, электронными деньгами, на расчетный счет и наложенным платежом. [Купив, Приобретя, Заказав] электрошокер в городе {город}, вы сможете [чувствовать, ощущать] себя [безопасно, спокойно, комфортно, в безопасности, защищено] на [темных, городских, вечерних, ночных, безлюдных]  улицах. </p> <H2>Виды электрошокеров</H2> <p> Интернет-магазином ShopShoker.ru [осуществляется, производится, ведется] продажа [надежных, эффективных, высококачественных, качественных, фирменных, высококлассных, проверенных, высокоэффективных, мощных] и недорогих устройств для [самообороны, самозащиты, защиты, обороны, обеспечения безопасности]. В нашем каталоге вы сможете [приобрести, купить, заказать]:</p> <ul> <li> Классические модели. Имеют [прямоугольную, простую, привычную] форму. [Отличаются, Обладают] высокой мощностью, [удобством, комфортностью, практичностью, надежностью] и [доступной, низкой, демократичной] ценой. [Наиболее, Самые]  [популярные, распространенные, востребованные]: Оса-888 Pro, [Оса-910, Оса-811, Оса-928] и т.д. </li> <li> Электрошокеры-фонари. Они [очень, весьма, достаточно] удобны, [потому что, поскольку] [ими, с их помощью] можно освещать [дорогу, путь, улицу] и [защищаться, защищать себя, обороняться] от [недоброжелателей, злоумышленников, хулиганов, шпаны, агрессивных людей, агрессоров, опасных людей, преступников]. [Самые, Наиболее] [популярные, востребованные, распространенные] электрошокеры с фонарем, купить которые можно в нашем [магазине, каталоге], это Верона-912, [Молния-1105, Oса X5/1318, Police 1101, Oса-1203, Oса Y-02] и др. </li> <li> [Дубинки,Шокеры-дубинки, Электрошокеры-дубинки]. [Очень, Весьма, Достаточно] [востребованы, популярны, распространены] среди [сотрудников, работников, представителей] силовых [структур, ведомств, организаций] и охранных [компаний, фирм, агентств]. Они отличаются [массивными, крупными, внушительными, большими] [размерами, габаритами] и [позволяют, дают возможность] [защищаться, обороняться, биться, сражаться, атаковать противника, наносить удары] в ближнем бою. </li> <li> Стреляющие. [Способны, позволяют, дают возможность] [поражать, обезвреживать, атаковать, нейтрализовать] [противника, нападающего, злоумышленника, хулигана] с [большого, существенного, значительного] расстояния.  Стреляющие модели [очень, весьма] [эффективны, надежны, действенны], но стоимость сменных кассет [достаточно, относительно] высокая. </li> <li> Женские. [Девушки, женщины, представительницы прекрасного пола] подвергаются [нападениям, атакам, домогательствам] [злоумышленников, хулиганов, недоброжелателей, агрессоров] [достаточно, довольно, очень] часто. Заказав электрошокер через интернет, вы сможете [обезопасить, уберечь] себя. Женские модели [отличаются, обладают] [компактными, небольшими, скромными, незначительными, миниатюрными, маленькими] размерами, поэтому [легко, просто, без проблем] [помещаются, вмещаются, влезают] в [дамскую, девичью] сумочку. </li> </ul> <H2>Почему стоит приобрести электрошокер?</H2> <p> Оружие с электрошоком – это легальный [способ, метод, предмет] самообороны, который [полностью, абсолютно, на 100%] безопасен для [здоровья, организма] [нападающего, атакующего, агрессора]. Он способен [временно, на время] [обезвредить, парализовать, нейтрализовать, отключить, вырубить, обездвижить, дезориентировать] [человека, хулигана, недоброжелателя, преступника, злоумышленника] не нанося ему [сильных, серьезных, опасных, существенных, значительных, летальных] повреждений. [Устройство, Прибор] издает [громкий, пронзительный, угрожающий, агрессивный] [треск, звук] во время [работы, разряда]. Это [позволит, даст возможность] [отпугнуть, напугать, припугнуть] [нападающего, атакующего] и избежать [столкновения, стычки, борьбы]. </p> <p> Если вы [живете, проживаете] в городе {город} и не знаете, где купить электрошокер, то загляните в ShopShoker.ru. У нас вы найдете модели, [различающиеся, отличающиеся] по мощности, [объему, количеству] дополнительных [функций, опций] и размеру. Даже самый дешевый парализатор [надежно, эффективно] [защитит, обезопасит] вас от [бродячих, диких, агрессивных, бездомных, дворовых, недружелюбных, враждебных]  [животных, собак] и [злоумышленников, хулиганов, преступников]. </p>";

		$line = preg_replace_callback(
	        '/\[(.*?)\]/',
	        function ($matches) {
	        	$variants = explode(",",$matches[1]);
	        	
	            return strtolower(trim($variants[rand(0,sizeof($variants)-1)]));
	        },
	        $line
	    );

	    echo $line;

		/*
		$html = new \Htmldom($this->curl('https://freelance.ru'));

		foreach($html->find('#s_projects .proj') as $element) {
			echo $element->find(".ptitle span")[0]->innertext."<br>";
			echo $element->find(".cost .hidden-xs")[0]->innertext."<br>";
		}
		

		echo $_ENV['LANS_USER'];
		*/

	}

	private function curl($url){
	    $headers[]  = "User-Agent:Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.2.13) Gecko/20101203 Firefox/3.6.13";
	    $headers[]  = "Accept:text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8";
	    $headers[]  = "Accept-Language:en-us,en;q=0.5";
	    $headers[]  = "Accept-Encoding:gzip,deflate";
	    $headers[]  = "Accept-Charset:ISO-8859-1,utf-8;q=0.7,*;q=0.7";
	    $headers[]  = "Keep-Alive:115";
	    $headers[]  = "Connection:keep-alive";
	    $headers[]  = "Cache-Control:max-age=0";

	    $curl = curl_init();
	    curl_setopt($curl, CURLOPT_URL, $url);
	    curl_setopt($curl, CURLOPT_HTTPHEADER, $headers);
	    curl_setopt($curl, CURLOPT_ENCODING, "gzip");
	    curl_setopt($curl, CURLOPT_RETURNTRANSFER, 1);
	    curl_setopt($curl, CURLOPT_FOLLOWLOCATION, 1);
	    $data = curl_exec($curl);
	    curl_close($curl);
	    return mb_convert_encoding($data,"UTF-8","Windows-1251");

	}
}
